# -*- coding: utf-8 -*-
from django.conf.urls import patterns

urlpatterns = patterns('weixin.views',
                       # 首页--your index
                       # ===============================================================================
                       # 业务数据统计页面
                       # ===============================================================================
                       (r'^$', 'index'),
                       (r'^get_biz_histogram_data/$', 'get_biz_histogram_data'),  # 业务星级柱状图数据
                       (r'^get_biz_pie_data/$', 'get_biz_pie_data'),  # 业务星级饼图数据
                       # ===============================================================================
                       # 任务数据统计页面
                       # ===============================================================================
                       (r'^task_data_page/$', 'task_data_page'),
                       (r'^task_histogram_data/$', 'task_histogram_data'),  # L123层任务数据统计柱状图
                       (r'^task_pie_data/$', 'task_pie_data'),  # L123层任务数据统计饼图
                       # ===============================================================================
                       # 微信js-sdk 样例页面
                       # ===============================================================================
                       (r'^share_template/$', 'share_template'),
                       )
