# -*- coding: utf-8 -*-
'''
@summary: 全局常量设置
用于本地开发环境
'''

# ===============================================================================
# APP 基本信息
# ===============================================================================
# TOCHANGE 在蓝鲸平台上注册的应用的编码
APP_CODE = 'yw_deploy'
# APP 密钥
SECRET_KEY = 'IA-oyQIX4pfhgY1<N=Wzz_fi@7kgSJFJ<4FGvusT9^h49?1<UA'
# ===============================================================================
# 数据库设置, 本地开发数据库设置
# ===============================================================================
DATABASES = {
    'default': {
        'ENGINE': 'django.db.backends.mysql',  # 我们默认用mysql
        'NAME': APP_CODE,                       # 数据库名 (默认与APP_CODE相同)
        'USER': 'root',                                    # 你的数据库user
        'PASSWORD': '',                                 # 你的数据库password
        'HOST': '127.0.0.1',                            # 开发的时候，使用localhost
        'PORT': '3306',               # 默认3306
    },
}

# ===============================================================================
# CELERY 配置   本地开发的 celery 的消息队列（RabbitMQ）配置
# ===============================================================================
BROKER_URL = 'amqp://guest:guest@127.0.0.1:5672/'

# ===============================================================================
# 蓝鲸内部系统配置
# ===============================================================================
# 蓝鲸平台的地址
BK_URL = "http://t.open.oa.com"
# 组件系统
COMPONENT_SYSTEM_HOST = "http://t.open.oa.com/component"
# 静态资源地址：
REMOTE_STATIC_URL = '%s/static_api/' % BK_URL

# ===============================================================================
# 外部系统地址
# ===============================================================================
# 敏感权限管理系统，auth.cm.com
DEV_SEC_AUTH = 'http://auth.cm.com:8080/auth?wsdl'
DEV_SEC_AUTH_CGIS = 'http://sec.cm.com/cgis/'

# ===============================================================================
# 去除没有必要的警告
# ===============================================================================
SILENCED_SYSTEM_CHECKS = ['1_8.W001', 'fields.W161', 'fields.W122']
